![sql](https://pngimg.com/d/mysql_PNG31.png)

# DataBase and MySQL

MySQL is a very popular open-source **relational database management system** (RDBMS).

## What is MySQL?

- MySQL is a relational database management system
- MySQL is open-source
- MySQL is free
- MySQL is ideal for both small and large applications
- MySQL is very fast, reliable, scalable, and easy to use
- MySQL is cross-platform
- MySQL is compliant with the ANSI SQL standard
- MySQL was first released in 1995
- MySQL is developed, distributed, and supported by Oracle Corporation
- MySQL is named after co-founder Monty Widenius's daughter: My

## Show Data On Your Web Site

To build a web site that shows data from a database, you will need:

- An RDBMS database program (like MySQL)
- A server-side scripting language, like PHP
- To use SQL to get the data you want
- To use HTML / CSS to style the page

**There are 2 types of databases:**
- Relational DBMS/DB(SQL): MySQL, Sqlite, Oracle, Postgresql
- Non-Relational DB(No-SQL): MogoDB, FireBase

## What is RDBMS?

RDBMS stands for Relational Database Management System.

- RDBMS is a program used to maintain a relational database.

- RDBMS is the basis for all modern database systems such as MySQL, Microsoft SQL Server, Oracle, and Microsoft Access.

- RDBMS uses SQL queries to access the data in the database.

## What is a Database Table?

- A table is a collection of related data entries, and it consists of columns and rows.

- A column holds specific information about every record in the table.

- A record (or row) is each individual entry that exists in a table.

| CustomerID |	CustomerName |	ContactName |	Address	City |	PostalCode |	Country
| :- | :- | :- | :- | :- | :- |
| 1 | Alfreds Futterkiste |	Maria Anders |	Obere Str. 57 |	Berlin	12209 |	Germany |
| 2 |	Ana Trujillo Emparedados y helados |	Ana Trujillo |	Avda. de la Constitución 2222 |	México D.F.	05021 |	Mexico |
| 3 |	Antonio Moreno | Taquería	Antonio Moreno |	Mataderos 2312 |	México D.F.	0502 |	Mexico |
| 4 | Around the Horn |	Thomas Hardy |	120 Hanover Sq.	London |	WA1 1DP |	UK |
| 5 |	Berglunds snabbköp |	Christina Berglund |	Berguvsvägen 8	Luleå |	S-958 22 |	Sweden |

## What is a Relational Database?

A relational database defines database relationships in the form of tables. The tables are related to each other - based on data common to each. Look at the following three tables "Customers", "Orders", and "Shippers" from the Northwind database:

**Customers Table**

| CustomerID |	CustomerName |	ContactName |	Address	City |	PostalCode |	Country
| :- | :- | :- | :- | :- | :- |
| 1 | Alfreds Futterkiste |	Maria Anders |	Obere Str. 57 |	Berlin	12209 |	Germany |
| 2 |	Ana Trujillo Emparedados y helados |	Ana Trujillo |	Avda. de la Constitución 2222 |	México D.F.	05021 |	Mexico |
| 3 |	Antonio Moreno | Taquería	Antonio Moreno |	Mataderos 2312 |	México D.F.	0502 |	Mexico |
| 4 | Around the Horn |	Thomas Hardy |	120 Hanover Sq.	London |	WA1 1DP |	UK |
| 5 |	Berglunds snabbköp |	Christina Berglund |	Berguvsvägen 8	Luleå |	S-958 22 |	Sweden |

The relationship between the "Customers" table and the "Orders" table is the CustomerID column:

**Orders Table**

|OrderID |	CustomerID |	EmployeeID |	OrderDate |	ShipperID |
| :- | :- | :- | :- | :- | 
|10278 |   5 |	8 |	1996-08-12 |	2 |
|10280 |	5 |	2 |	1996-08-14 |	1 |
|10308 |	2 |	7 |	1996-09-18 |	3 |
|10355 |   4 |	6 |	1996-11-15 |	1 |
|10365 |	3 |	3 |	1996-11-27 |	2 |
|10383 |	4 |	8 |	1996-12-16 |	3 |
|10384 |	5 |	3 |	1996-12-16 |	3 |

The relationship between the "Orders" table and the "Shippers" table is the ShipperID column:

**Shippers Table**

| ShipperID |	ShipperName |	Phone |
| :- | :- | :- |
| 1 |	Speedy Express |	(503) 555-9831 |
| 2 |	United Package |	(503) 555-3199 |
| 3 |	Federal Shipping |	(503) 555-9931 |

**At first you should install MySQL Community and Workbench**

![sql](https://learn.microsoft.com/en-us/azure/mysql/single-server/media/connect-workbench/3-workbench-sql-tab.png)

**Keep in Mind That...**
- SQL keywords are `NOT case sensitive`: `select` is the same as `SELECT`

## 4 operation

**CRUD**

`C`: Create

`R`: REad/Retrieve

`U`: Update

`D`: Delete

## MySQL CREATE DATABASE Statement

The `CREATE DATABASE` statement is used to create a new SQL database.

- Syntax
```sql
CREATE DATABASE databasename;
```
- Example
```sql
CREATE DATABASE testDB;
```

## MySQL DROP DATABASE Statement

The `DROP DATABASE` statement is used to drop an existing SQL database.

- Syntax
```sql
DROP DATABASE databasename;
```
- Example
```sql
DROP DATABASE testDB;
```

## MySQL CREATE TABLE Statement

The `CREATE TABLE` statement is used to create a new table in a database.

- Syntax
```sql
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    column3 datatype,
   ....
);
```
The `column` parameters specify the names of the columns of the table.
The `datatype` parameter specifies the type of data the column can hold (e.g. varchar, integer, date, etc.).

- Example

The following example creates a `table` called "Persons" that contains five columns: PersonID, LastName, FirstName, Address, and City:
```sql
CREATE TABLE Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
);
```
The `PersonID` column is of type int and will hold an integer.
The `LastName`, `FirstName`, `Address`, and `City` columns are of type varchar and will hold characters, and the maximum length for these fields is 255 characters.

The empty "Persons" table will now look like this:
|PersonID|	LastName|	FirstName|	Address	City|
| --- | --- | --- | --- |
|     |     |     |     |
|     |     |     |     |

## MySQL DROP TABLE Statement

The `DROP TABLE` statement is used to drop an existing table in a database.

- Syntax
```sql
DROP TABLE table_name;
```
- Example
```sql
DROP TABLE Shippers;
```

## MySQL ALTER TABLE Statement

The `ALTER TABLE` statement is used to `add`, `delete`, or `modify` columns in an existing table. The `ALTER TABLE` is also used to add and drop various constraints on an existing table.

### ALTER TABLE - ADD Column

- The following SQL `adds` an "Email" column to the "Customers" table:
```sql
ALTER TABLE Customers
ADD Email varchar(255);
```

### ALTER TABLE - DROP COLUMN

To `delete` a column in a table, use the following syntax **(notice that some database systems don't allow deleting a column)**.

The following SQL `deletes` the "Email" column from the "Customers" table:
```sql
ALTER TABLE Customers
DROP COLUMN Email;
```

### ALTER TABLE - MODIFY COLUMN

To `change` the data type of a column in a table, use the following syntax:
```sql
ALTER TABLE table_name
MODIFY COLUMN column_name datatype;
```

## MySQL Constraints

SQL `constraints` are used to specify rules for data in a table.

### Create Constraints

`Constraints` can be specified when the table is created with the `CREATE TABLE` statement, or after the table is created with the `ALTER TABLE` statement.

- Syntax
```sql
CREATE TABLE table_name (
    column1 datatype constraint,
    column2 datatype constraint,
    column3 datatype constraint,
    ....
);
```
SQL `constraints` are used to `specify rules` for the data in a table.

Constraints are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the table. If there is any violation between the constraint and the data action, the action is aborted.

Constraints can be column level or table level. Column level constraints apply to a column, and table level constraints apply to the whole table.

The following constraints are commonly used in SQL:

- `NOT NULL` - Ensures that a column cannot have a NULL value
- `UNIQUE` - Ensures that all values in a column are different
- `PRIMARY KEY` - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table
- `FOREIGN KEY` - Prevents actions that would destroy links between tables
- `CHECK` - Ensures that the values in a column satisfies a specific condition
- `DEFAULT` - Sets a default value for a column if no value is specified
- `CREATE INDEX` - Used to create and retrieve data from the database very quickly

## MySQL NOT NULL Constraint

By default, a column can hold `NULL` values.
The `NOT NULL` constraint enforces a column to NOT accept NULL values.

This enforces a field to always contain a value, which means that you cannot insert a new record, or update a record without adding a value to this field.

### NOT NULL on CREATE TABLE

The following SQL ensures that the "ID", "LastName", and "FirstName" columns will NOT accept NULL values when the "Persons" table is created:
```sql
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255) NOT NULL,
    Age int
);
```

## MySQL UNIQUE Constraint

The **UNIQUE** constraint ensures that all values in a column are different.

Both the **UNIQUE** and `PRIMARY KEY` constraints provide a guarantee for uniqueness for a column or set of columns.

A `PRIMARY KEY` constraint automatically has a **UNIQUE** constraint.

However, you can have **many UNIQUE** constraints per table, but only `one PRIMARY KEY` constraint per table.

### UNIQUE Constraint on CREATE TABLE

The following SQL creates a `UNIQUE` constraint on the "ID" column when the "Persons" table is created:
```sql
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    UNIQUE (ID)
);
```
To name a `UNIQUE` constraint, and to define a UNIQUE constraint on multiple columns, use the following SQL syntax:
```sql
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CONSTRAINT UC_Person UNIQUE (ID,LastName)
);
```

## MySQL PRIMARY KEY Constraint

The `PRIMARY KEY` constraint uniquely identifies each record in a table.

`Primary keys` must contain UNIQUE values, and cannot contain NULL values.

A table can have only **ONE primary key**; and in the table, this primary key can consist of single or multiple columns (fields).

### PRIMARY KEY on CREATE TABLE

The following SQL creates a PRIMARY KEY on the "ID" column when the "Persons" table is created:
```sql
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    PRIMARY KEY (ID)
);
```
To allow naming of a PRIMARY KEY constraint, and for defining a PRIMARY KEY constraint on multiple columns, use the following SQL syntax:
```sql
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CONSTRAINT PK_Person PRIMARY KEY (ID,LastName)
);
```
**Note:** In the example above there is only ONE PRIMARY KEY (PK_Person). However, the VALUE of the primary key is made up of TWO COLUMNS (ID + LastName).

## MySQL FOREIGN KEY Constraint

The `FOREIGN KEY` constraint is used to prevent actions that would destroy links between tables.

A `FOREIGN KEY` is a field (or collection of fields) in one table, that refers to the PRIMARY KEY in another table.

The table with the foreign key is called the child table, and the table with the primary key is called the referenced or parent table.

Look at the following two tables:

**Persons Table**

| PersonID |	LastName |	FirstName |	Age |
| :- | :- | :- | :- |
| 1 |	Hansen |	Ola |	30 |
| 2 |	Svendson |	Tove |	23 |
| 3 |	Pettersen |	Kari |	20 |

**Orders Table**

| OrderID |	OrderNumber |	PersonID |
| :- | :- | :- |
| 1 |	77895 |	3 |
| 2 |	44678 |	3 |
| 3 |	22456 |	2 |
| 4 |	24562 |	1 |


Notice that the `"PersonID"` column in the `"Orders"` table points to the `"PersonID"` column in the `"Persons"` table.

The `"PersonID"` column in the `"Persons"` table is the `PRIMARY KEY` in the `"Persons"` table.

The `"PersonID"` column in the `"Orders"` table is a `FOREIGN KEY` in the `"Orders"` table.

The `FOREIGN KEY` constraint prevents invalid data from being inserted into the `foreign key column`, because it has to be one of the values contained in the parent table.

### FOREIGN KEY on CREATE TABLE

The following SQL creates a `FOREIGN KEY` on the `"PersonID"` column when the "Orders" table is created:
```sql
CREATE TABLE Orders (
    OrderID int NOT NULL,
    OrderNumber int NOT NULL,
    PersonID int,
    PRIMARY KEY (OrderID),
    FOREIGN KEY (PersonID) REFERENCES Persons(PersonID)
);
```
To allow naming of a FOREIGN KEY constraint, and for defining a FOREIGN KEY constraint on multiple columns, use the following SQL syntax:
```sql
CREATE TABLE Orders (
    OrderID int NOT NULL,
    OrderNumber int NOT NULL,
    PersonID int,
    PRIMARY KEY (OrderID),
    CONSTRAINT FK_PersonOrder FOREIGN KEY (PersonID)
    REFERENCES Persons(PersonID)
);
```

## MySQL DEFAULT Constraint

The `DEFAULT` constraint is used to set a default value for a column.

The default value will be added to all new records, if no other value is specified.

The following SQL sets a DEFAULT value for the "City" column when the "Persons" table is created:
```sql
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    City varchar(255) DEFAULT 'Sandnes'
);
```
The DEFAULT constraint can also be used to insert system values, by using functions like CURRENT_DATE():
```sql
CREATE TABLE Orders (
    ID int NOT NULL,
    OrderNumber int NOT NULL,
    OrderDate date DEFAULT CURRENT_DATE()
);
```

## MySQL CREATE INDEX Statement

The CREATE INDEX statement is used to create indexes in tables.

Indexes are used to retrieve data from the database more quickly than otherwise. The users cannot see the indexes, they are just used to speed up searches/queries.

Creates an index on a table. Duplicate values are allowed:
```sql
CREATE INDEX index_name
ON table_name (column1, column2, ...);
```
Creates a unique index on a table. Duplicate values are not allowed:
```sql
CREATE UNIQUE INDEX index_name
ON table_name (column1, column2, ...);
```

## MySQL Dates

As long as your data contains only the date portion, your queries will work as expected. However, if a time portion is involved, it gets more complicated.

### MySQL Date Data Types

MySQL comes with the following data types for storing a `date` or a date/time value in the database:

- `DATE` - format YYYY-MM-DD
- `DATETIME` - format: YYYY-MM-DD HH:MI:SS
- `TIMESTAMP` `- format: YYYY-MM-DD HH:MI:SS
- `YEAR` - format YYYY or YY

##  MySQL Data Types

The `data type` of a column defines what value the column can hold: integer, character, money, date and time, binary, and so on.

Each column in a database table is required to have a name and a data type.

An SQL developer must decide what type of data that will be stored inside each column when creating a table. The data type is a guideline for SQL to understand what type of data is expected inside of each column, and it also identifies how SQL will interact with the stored data.

In MySQL there are three main data types: string, numeric, and date and time.

### String Data Types

| Data type |	Description |
| :- | :- |
| CHAR(size) |	A FIXED length string (can contain letters, numbers, and special characters). The size parameter specifies the column length in characters - can be from 0 to 255. Default is 1 |
| VARCHAR(size) |	A VARIABLE length string (can contain letters, numbers, and special characters). The size parameter specifies the maximum column length in characters - can be from 0 to 65535 |
| BINARY(size) |	Equal to CHAR(), but stores binary byte strings. The size parameter specifies the column length in bytes. Default is 1 |
| VARBINARY(size) |	Equal to VARCHAR(), but stores binary byte strings. The size parameter specifies the maximum column length in bytes. |
| TINYBLOB |	For BLOBs (Binary Large OBjects). Max length: 255 bytes |
| TINYTEXT |	Holds a string with a maximum length of 255 characters |
| TEXT(size) |	Holds a string with a maximum length of 65,535 bytes |
| BLOB(size) |	For BLOBs (Binary Large OBjects). Holds up to 65,535 bytes of data |
| MEDIUMTEXT |	Holds a string with a maximum length of 16,777,215 characters |
| MEDIUMBLOB |	For BLOBs (Binary Large OBjects). Holds up to 16,777,215 bytes of data |
| LONGTEXT |	Holds a string with a maximum length of 4,294,967,295 characters |
| LONGBLOB |	For BLOBs (Binary Large OBjects). Holds up to 4,294,967,295 bytes of data |
| ENUM(val1, val2, val3, ...) |	A string object that can have only one value, chosen from a list of possible values. You can list up to 65535 values in an ENUM list. If a value is inserted that is not in the list, a blank value will be inserted. The values are sorted in the order you enter them |
| SET(val1, val2, val3, ...) |	A string object that can have 0 or more values, chosen from a list of possible values. You can list up to 64 values in a SET list |

### Numeric Data Types

| Data type |	Description |
| :- | :- |
| BIT(size) |	A bit-value type. The number of bits per value is specified in size. The size parameter can hold a value from 1 to 64. The default value for size is 1. |
| TINYINT(size) |	A very small integer. Signed range is from -128 to 127. Unsigned range is from 0 to 255. The size parameter specifies the maximum display width (which is 255) |
| BOOL |	Zero is considered as false, nonzero values are considered as true. |
| BOOLEAN |	Equal to BOOL |
| SMALLINT(size) |	A small integer. Signed range is from -32768 to 32767. Unsigned range is from 0 to 65535. The size parameter specifies the maximum display width (which is 255) |
| MEDIUMINT(size) |	A medium integer. Signed range is from -8388608 to 8388607. Unsigned range is from 0 to 16777215. The size parameter specifies the maximum display width (which is 255) |
| INT(size) |	A medium integer. Signed range is from -2147483648 to 2147483647. Unsigned range is from 0 to 4294967295. The size parameter specifies the maximum display width (which is 255) |
| INTEGER(size) |	Equal to INT(size) |
| BIGINT(size) |	A large integer. Signed range is from -9223372036854775808 to 9223372036854775807. Unsigned range is from 0 to 18446744073709551615. The size parameter specifies the maximum display width (which is 255) |
| FLOAT(size, d) |	A floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. This syntax is deprecated in MySQL 8.0.17, and it will be removed in future MySQL versions |
| FLOAT(p) |	A floating point number. MySQL uses the p value to determine whether to use FLOAT or DOUBLE for the resulting data type. If p is from 0 to 24, the data type becomes FLOAT(). If p is from 25 to 53, the data type becomes DOUBLE() |
| DOUBLE(size, d) |	A normal-size floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter |
| DOUBLE PRECISION(size, d)	 | 
| DECIMAL(size, d) |	An exact fixed-point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. The maximum number for size is 65. The maximum number for d is 30. The default value for size is 10. The default value for d is 0. |
| DEC(size, d) |	Equal to DECIMAL(size,d) |

### Date and Time Data Types

| Data type |	Description |
| :- | :- |
| DATE |	A date. Format: YYYY-MM-DD. The supported range is from '1000-01-01' to '9999-12-31' |
| DATETIME(fsp) |	A date and time combination. Format: YYYY-MM-DD hh:mm:ss. The supported range is from '1000-01-01 00:00:00' to '9999-12-31 23:59:59'. Adding DEFAULT and ON UPDATE in the column definition to get automatic initialization and updating to the current date and time |
| TIMESTAMP(fsp) |	A timestamp. TIMESTAMP values are stored as the number of seconds since the Unix epoch ('1970-01-01 00:00:00' UTC). Format: YYYY-MM-DD hh:mm:ss. The supported range is from '1970-01-01 00:00:01' UTC to '2038-01-09 03:14:07' UTC. Automatic initialization and updating to the current date and time can be specified using DEFAULT CURRENT_TIMESTAMP and ON UPDATE CURRENT_TIMESTAMP in the column definition |
| TIME(fsp) |	A time. Format: hh:mm:ss. The supported range is from '-838:59:59' to '838:59:59' |
| YEAR |	A year in four-digit format. Values allowed in four-digit format: 1901 to 2155, and 0000. MySQL 8.0 does not support year in two-digit format. |

### Semicolon after SQL Statements?

Some database systems require a semicolon at the end of each SQL statement.

Semicolon is the standard way to separate each SQL statement in database systems that allow more than one SQL statement to be executed in the same call to the server.

### Some of The Most Important SQL Commands

- `SELECT` - extracts data from a database
- `UPDATE` - updates data in a database
- `DELETE` - deletes data from a database
- `INSERT INTO` - inserts new data into a database
- `CREATE DATABASE` - creates a new database
- `ALTER DATABASE` - modifies a database
- `CREATE TABLE` - creates a new table
- `ALTER TABLE` - modifies a table
- `DROP TABLE` - deletes a table
- `CREATE INDEX` - creates an index (search key)
- `DROP INDEX` - deletes an index

### The MySQL SELECT Statement

The `SELECT` statement is used to select data from a database.

The data returned is stored in a result table, called the result-set.

**SELECT Syntax**
```sql
SELECT column1, column2, ...
FROM table_name;
```

Here, column1, column2, ... are the field names of the table you want to select data from. If you want to select all the fields available in the table, use the following syntax:
```sql
SELECT * FROM table_name;
```

```sql
SELECT CustomerName, City, Country FROM Customers;
```

## MySQL WHERE Clause

The `WHERE` clause is used to filter records.

It is used to extract only those records that fulfill a specified condition.

- WHERE Syntax
```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```
- Example
```sql
SELECT * FROM Customers
WHERE Country = 'Mexico';
```

### Operators in The WHERE Clause

The following operators can be used in the WHERE clause:
| Operator |	Description |
| :- | :- |
| = |	Equal |	
| > |	Greater than |	
| < |	Less than |	
| >= |	Greater than or equal |	
| <= |	Less than or equal |	
| <> |	Not equal. **Note**: In some versions of SQL this operator may be written as !=	 |
| BETWEEN |	Between a certain range	 |
| LIKE |	Search for a pattern |	
| IN |	To specify multiple possible values for a column |

**Some examples:**
```sql
SELECT * FROM Products
WHERE Price BETWEEN 50 AND 60;
```
```sql
SELECT * FROM Customers
WHERE City LIKE 's%';
-- City shows that starts with `s`
```
```sql
SELECT * FROM Customers
WHERE City IN ('Paris','London');
```

## MySQL AND, OR and NOT Operators

The `WHERE clause` can be combined with `AND`, `OR`, and `NOT` operators.

The `AND` and `OR` operators are used to filter records based on more than one condition:

The `AND` operator displays a record if all the conditions separated by AND are TRUE.
The `OR` operator displays a record if any of the conditions separated by OR is TRUE.
The `NOT` operator displays a record if the condition(s) is NOT TRUE.

- AND Syntax
```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND condition2 AND condition3 ...;
```

- OR Syntax
```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition1 OR condition2 OR condition3 ...;
```

- NOT Syntax
```sql
SELECT column1, column2, ...
FROM table_name
WHERE NOT condition;
```

You can also `combine` the AND, OR and NOT operators.
```sql
SELECT * FROM Customers
WHERE Country = 'Germany' AND (City = 'Berlin' OR City = 'Stuttgart');
```

## MySQL ORDER BY Keyword

The `ORDER BY` keyword is used to sort the result-set in ascending or descending order.

The `ORDER BY` keyword sorts the records in ascending order by default. To sort the records in `descending order`, use the `DESC keyword`.

`DESC keyword` is default.
- ORDER BY Syntax
```sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;
```
- Example
```sql
SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC;
```

## MySQL INSERT INTO Statement

The `INSERT INTO` statement is used to `insert new records` in a table.

It is possible to write the INSERT INTO statement in two ways:

1. Specify both the column names and the values to be inserted:
```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```
2. If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:
```sql
INSERT INTO table_name
VALUES (value1, value2, value3, ...);
```

## MySQL NULL Values

A field with a `NULL` value is a field with no value.

If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.

It is not possible to test for NULL values with comparison operators, such as =, <, or <>.

We will have to use the `IS NULL` and `IS NOT NULL` operators instead.

- IS NULL Syntax
```sql
SELECT column_names
FROM table_name
WHERE column_name IS NULL;
```
- IS NOT NULL Syntax
```sql
SELECT column_names
FROM table_name
WHERE column_name IS NOT NULL;
```
**Examples**
- The `IS NULL` operator is used to test for empty values (NULL values).
```sql
SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NULL;
```
- The `IS NOT NULL` operator is used to test for non-empty values (NOT NULL values).
```sql
SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NOT NULL;
```

## MySQL UPDATE Statement

The `UPDATE` statement is used to modify the existing records in a table.
- Example
```sql
UPDATE Customers
SET PostalCode = 00000
WHERE Country = 'Mexico';
```

## MySQL DELETE Statement

The `DELETE` statement is used to delete existing records in a table.
```sql
DELETE FROM table_name WHERE condition;
```
- Example
```sql
DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';
```

## MySQL LIMIT Clause

The `LIMIT` clause is used to specify the number of records to return.

The `LIMIT` clause is useful on large tables with thousands of records. Returning a large number of records can impact performance.

- Example
```sql
SELECT * FROM Customers
WHERE Country='Germany'
LIMIT 3;
-- It shows the first three
```
**limit x,y** ---> `It shows between x and y`

## MySQL MIN() and MAX() Functions

The `MIN()` function returns the smallest value of the selected column.

The `MAX()` function returns the largest value of the selected column.

- Examples
```sql
SELECT MIN(Price) AS SmallestPrice
FROM Products;
```

```sql
SELECT MAX(Price) AS LargestPrice
FROM Products;
```

## MySQL LIKE Operator

The `LIKE` operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

The percent sign `(%)` represents zero, one, or multiple characters
The underscore sign (_) represents one, single character
The percent sign and the underscore can also be used in combinations!

- Example
`The following SQL statement selects all customers with a CustomerName starting with "a":`
```sql
SELECT * FROM Customers
WHERE CustomerName LIKE 'a%';
```

## MySQL IN Operator

The `IN` operator allows you to specify multiple values in a WHERE clause.

The `IN` operator is a shorthand for multiple OR conditions.
```sql
SELECT * FROM Customers
WHERE Country IN ('Germany', 'France', 'UK');
```

## MySQL BETWEEN Operator

The `BETWEEN` operator selects values within a given range. The values can be numbers, text, or dates.

The `BETWEEN` operator is inclusive: begin and end values are included.
```sql
SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20;
```

## MySQL UNION Operator

The `UNION` operator is used to combine the result-set of two or more SELECT statements.

- Every SELECT statement within UNION must have the same number of columns
- The columns must also have similar data types
- The columns in every SELECT statement must also be in the same order
```sql
SELECT City FROM Customers
UNION
SELECT City FROM Suppliers
ORDER BY City;
```

## MySQL GROUP BY Statement

The `GROUP BY` statement groups rows that have the same values into summary rows, like "find the number of customers in each country".

The `GROUP BY` statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.
```sql
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;
```

## MySQL COUNT(), AVG() and SUM() Functions

The `COUNT()` function returns the number of rows that matches a specified criterion.
```sql
SELECT COUNT(column_name)
FROM table_name
WHERE condition;
```
The `AVG()` function returns the average value of a numeric column. 
```sql
SELECT AVG(column_name)
FROM table_name
WHERE condition;
```
The `SUM()` function returns the total sum of a numeric column.
```sql
SELECT SUM(column_name)
FROM table_name
WHERE condition;
```

## MySQL EXISTS Operator

The `EXISTS` operator is used to test for the existence of any record in a subquery.

The `EXISTS` operator returns TRUE if the subquery returns one or more records.

The following SQL statement returns TRUE and lists the suppliers with a product price less than 20:
```sql
SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20);
```

## MySQL ANY and ALL Operators

The `ANY` and `ALL` operators allow you to perform a comparison between a single column value and a range of other values.

The `ANY` operator:

- returns a boolean value as a result
- returns TRUE if ANY of the subquery values meet the condition
`ANY` means that the condition will be true if the operation is true for any of the values in the range.
```sql
SELECT column_name(s)
FROM table_name
WHERE column_name operator ANY
  (SELECT column_name
  FROM table_name
  WHERE condition);
```

The `ALL` operator:

returns a boolean value as a result
returns TRUE if ALL of the subquery values meet the condition
is used with SELECT, WHERE and HAVING statements
`ALL` means that the condition will be true only if the operation is true for all values in the range.
```sql
SELECT ALL column_name(s)
FROM table_name
WHERE condition;
```